{
    "common": {
        "name": "procon-ip",
        "version": "1.3.1",
        "news": {
            "1.3.1": {
                "en": "Fix manual dosage control abilities.",
                "de": "Behebung der manuellen Dosierungsmöglichkeiten.",
                "ru": "Исправьте ручные способности контроля дозировки.",
                "pt": "Corrigir habilidades manuais de controle de dosagem.",
                "nl": "Reparatie handmatige controlevaardigheden.",
                "fr": "Fixer des capacités manuelles de contrôle des doses.",
                "it": "Fissare le abilità di controllo del dosaggio manuale.",
                "es": "Fijar habilidades de control de dosis manuales.",
                "pl": "Współczynnik ręczny.",
                "uk": "Фіксувати ручні здібності контролю дозування.",
                "zh-cn": "固定手工操作控制能力。."
            },
            "1.3.0": {
                "en": "Remove restrictions on dosage control relays by enabling manual switching, add additional boolean states for dosage control information (formerly only available as combined bit-state/integer value as delivered by the GetState.csv and dependency updates.",
                "de": "Entfernen von Einschränkungen der Dosierrelais (manuelles Schalten ermöglicht), hinzufügen zusätzlicher bool'scher Zustände für die Dosiersteuerung-Info (früher nur als kombinierter Bit-State/Integer-Wert, wie von der GetState.csv geliefert und Abhängigkeitsaktualisierungen.",
                "ru": "Удалите ограничения на реле управления дозировками, позволяя ручному переключению, добавьте дополнительные boolean состояния для информации о контроле дозировки (ранее доступны только в качестве комбинированного разряда / целого числа, как доставлено GetState.csv и обновления зависимости.",
                "pt": "Remova as restrições nos relés de controle de dosagem, permitindo a comutação manual, adicione estados booleanos adicionais para informações de controle de dosagem (anteriormente apenas disponíveis como valor bit-state/integer combinado como entregue pelo GetState.csv e atualizações de dependência.",
                "nl": "Verwijder de beperkingen van de doseringscontrole door handmatig te verwisselen, extra boolean staten toevoegen voor doseringscontrole informatie die alleen beschikbaar is als gecombineerd kleine integerwaarde als afleverings.",
                "fr": "Retirer les restrictions sur les relais de contrôle posologique en permettant le commutation manuelle, ajouter des états booléens supplémentaires pour l'information de contrôle posologique (anciennement seulement disponible comme valeur bit-état combinée / entier comme délivré par le GetState.csv et les mises à jour de dépendance.",
                "it": "Rimuovere le restrizioni sui relè di controllo del dosaggio consentendo la commutazione manuale, aggiungere ulteriori stati booleani per le informazioni di controllo del dosaggio (precedentemente disponibili solo come valore combinato bit-state/integer come fornito dagli aggiornamenti GetState.csv e dipendenza.",
                "es": "Eliminar las restricciones de los relés de control de dosis permitiendo la conmutación manual, añadir estados booleanos adicionales para la información de control de dosis (antes sólo disponibles como el valor combinado de bit-state/integer como lo entregan los GetState.csv y actualizaciones de dependencia.",
                "pl": "Remove ograniczenia dotyczące przekaźników dosage poprzez umożliwienie przełączania ręcznego, dodanie dodatkowych stanów dosage (dawniej dostępne tylko jako wartość połączona bit-state/integer, jak dostarczana przez aktualizacje GetState.csv i zależność).",
                "uk": "Зняти обмеження на реле дозування, дозволяючи ручним перемиканням, додати додаткові болеанові стани для контролю дозування інформації (звичайно доступні тільки як комбінований біт-держава / інтегер значення, як доставлений GetState.csv і оновлення залежності.",
                "zh-cn": "取消对实况控制的控制的限制,使手工转换,增加实绩控制信息的善意国家(以前只作为Get国提供的共同标值。."
            },
            "1.2.3": {
                "en": "Dependencies update",
                "de": "Aktualisierung der Abhängigkeiten",
                "ru": "Обновление зависимости",
                "pt": "Atualização de dependências",
                "nl": "Afhankelijk van updates",
                "fr": "Mise à jour des dépendances",
                "it": "Aggiornamento delle dipendenze",
                "es": "Actualización de las dependencias",
                "pl": "Aktualizacja",
                "uk": "Оновлення залежності",
                "zh-cn": "B. 现状更新"
            },
            "1.2.2": {
                "en": "Dependencies update",
                "de": "Aktualisierung der Abhängigkeiten",
                "ru": "Обновление зависимости",
                "pt": "Atualização de dependências",
                "nl": "Afhankelijk van updates",
                "fr": "Mise à jour des dépendances",
                "it": "Aggiornamento delle dipendenze",
                "es": "Actualización de las dependencias",
                "pl": "Aktualizacja",
                "uk": "Оновлення залежності",
                "zh-cn": "B. 现状更新"
            },
            "1.2.1": {
                "en": "Bugfix release (fix connection problems)",
                "de": "Bugfix-Release (Verbindungsprobleme beheben)",
                "ru": "Релиз Bugfix (исправить проблемы с подключением)",
                "pt": "Versão Bugfix (corrigir problemas de conexão)",
                "nl": "Bugfix-release (verbindingsproblemen oplossen)",
                "fr": "Version de correction de bugs (résolution des problèmes de connexion)",
                "it": "Rilascio bugfix (risolvere problemi di connessione)",
                "es": "Lanzamiento de corrección de errores (solucionar problemas de conexión)",
                "pl": "Wydanie poprawki błędów (naprawienie problemów z połączeniem)",
                "zh-cn": "错误修复发布（修复连接问题）"
            },
            "1.2.0": {
                "en": "Update `procon-ip` API library package to v1.3.2 (which should fix a bug that let the relay switching fail) and further dependencies.",
                "de": "Aktualisieren Sie das `procon-ip`-API-Bibliothekspaket auf v1.3.2 (das einen Fehler beheben sollte, der das Umschalten des Relais fehlschlagen ließ) und weitere Abhängigkeiten.",
                "ru": "Обновите пакет библиотеки API `procon-ip` до версии 1.3.2 (что должно исправить ошибку, приводившую к сбою переключения реле) и дополнительные зависимости.",
                "pt": "Atualize o pacote de biblioteca da API `procon-ip` para v1.3.2 (que deve corrigir um bug que deixa a comutação de retransmissão falhar) e outras dependências.",
                "nl": "Update `procon-ip` API-bibliotheekpakket naar v1.3.2 (wat een bug zou moeten oplossen waardoor het schakelen tussen relais mislukt) en verdere afhankelijkheden.",
                "fr": "Mettez à jour le package de bibliothèque d'API `procon-ip` vers la v1.3.2 (qui devrait corriger un bogue qui faisait échouer la commutation de relais) et d'autres dépendances.",
                "it": "Aggiorna il pacchetto della libreria API `procon-ip` alla v1.3.2 (che dovrebbe correggere un bug che lasciava fallire il cambio di relè) e ulteriori dipendenze.",
                "es": "Actualice el paquete de la biblioteca API `procon-ip` a v1.3.2 (lo que debería corregir un error que permitía que fallara el cambio de relé) y otras dependencias.",
                "pl": "Zaktualizuj pakiet biblioteki API `procon-ip` do wersji 1.3.2 (co powinno naprawić błąd, który pozwalał na niepowodzenie przełączania przekaźnika) i inne zależności.",
                "zh-cn": "将 `procon-ip` API 库包更新到 v1.3.2（应该会修复一个导致中继切换失败的错误）和更多依赖项。"
            },
            "1.1.1": {
                "en": "Minor release, moving the API library source code into a separate repository (npm package) and adding capability to update `common.name` attributes when object labels change.",
                "de": "Kleines Update: Verschieben des Quellcodes der API-Bibliothek in ein separates Repository (npm-Paket) und Hinzufügen der Funktion zum Aktualisieren der Attribute \"common.name\", wenn sich die Objektbezeichnungen ändern.",
                "ru": "Незначительный выпуск, в котором исходный код библиотеки API перемещен в отдельный репозиторий (пакет npm) и добавлена возможность обновлять атрибуты common.name при изменении меток объектов.",
                "pt": "Versão secundária, movendo o código-fonte da biblioteca API para um repositório separado (pacote npm) e adicionando capacidade para atualizar os atributos `common.name` quando os rótulos dos objetos mudam.",
                "nl": "Kleine uitgave, waarbij de broncode van de API-bibliotheek naar een aparte repository (npm-pakket) wordt verplaatst en de mogelijkheid wordt toegevoegd om de kenmerken van 'common.name' bij te werken wanneer objectlabels veranderen.",
                "fr": "Version mineure, déplacement du code source de la bibliothèque API dans un référentiel séparé (package npm) et ajout de la possibilité de mettre à jour les attributs `common.name` lorsque les étiquettes d'objet changent.",
                "it": "Versione minore, spostamento del codice sorgente della libreria API in un repository separato (pacchetto npm) e aggiunta della capacità di aggiornare gli attributi `common.name` quando le etichette degli oggetti cambiano.",
                "es": "Lanzamiento menor, moviendo el código fuente de la biblioteca API a un repositorio separado (paquete npm) y agregando capacidad para actualizar los atributos `common.name` cuando cambian las etiquetas de los objetos.",
                "pl": "Wydanie drugorzędne, przenoszące kod źródłowy biblioteki API do oddzielnego repozytorium (pakiet npm) i dodające możliwość aktualizowania atrybutów common.name, gdy zmieniają się etykiety obiektów.",
                "zh-cn": "次要版本，将API库的源代码移动到单独的存储库（npm软件包）中，并添加了在对象标签更改时更新“ common.name”属性的功能。"
            },
            "1.0.2": {
                "en": "Fine tuned the http requests to the pool controller",
                "de": "Feinabstimmung der http-Anforderungen an den Pool-Controller",
                "ru": "Точно настроены HTTP-запросы к контроллеру пула",
                "pt": "Ajustou as solicitações de http para o controlador de pool",
                "nl": "De http-verzoeken aan de poolcontroller verfijnd",
                "fr": "Affiner les requêtes http au contrôleur de pool",
                "it": "Ottimizzazione delle richieste http al controller del pool",
                "es": "Ajustó las solicitudes http al controlador de la piscina",
                "pl": "Dostrojono żądania http do kontrolera puli",
                "zh-cn": "微调对池控制器的http请求"
            },
            "1.0.1": {
                "en": "Hotfix release: Fix Object State updates",
                "de": "Hotfix-Version: Aktualisierungen des Objektstatus korrigieren",
                "ru": "Выпуск исправления: исправление обновлений состояния объекта",
                "pt": "Versão de hotfix: corrigir atualizações de estado de objeto",
                "nl": "Hotfix-release: updates van objectstatus repareren",
                "fr": "Version du correctif: correction des mises à jour de l'état des objets",
                "it": "Versione hotfix: correggi gli aggiornamenti dello stato dell'oggetto",
                "es": "Lanzamiento de revisión: Reparar actualizaciones de estado de objeto",
                "pl": "Wydanie poprawki: napraw aktualizacje stanu obiektu",
                "zh-cn": "修补程序版本：修复对象状态更新"
            },
            "1.0.0": {
                "en": "Stable release for the official repos. For details see: https://github.com/ylabonte/ioBroker.procon-ip",
                "de": "Stabile Veröffentlichung für die offiziellen Repos. Weitere Informationen finden Sie unter: https://github.com/ylabonte/ioBroker.procon-ip",
                "ru": "Стабильный релиз для официальных репо. Для получения дополнительной информации см .: https://github.com/ylabonte/ioBroker.procon-ip",
                "pt": "Lançamento estável para os repositórios oficiais. Para detalhes, consulte: https://github.com/ylabonte/ioBroker.procon-ip",
                "nl": "Stabiele release voor de officiële repo's. Zie voor details: https://github.com/ylabonte/ioBroker.procon-ip",
                "fr": "Version stable pour les repos officiels. Pour plus de détails, voir: https://github.com/ylabonte/ioBroker.procon-ip",
                "it": "Rilascio stabile per i repository ufficiali. Per i dettagli, consultare: https://github.com/ylabonte/ioBroker.procon-ip",
                "es": "Lanzamiento estable para los repositorios oficiales. Para más detalles, consulte: https://github.com/ylabonte/ioBroker.procon-ip",
                "pl": "Stabilna wersja oficjalnych repozytoriów. Aby uzyskać szczegółowe informacje, patrz: https://github.com/ylabonte/ioBroker.procon-ip",
                "zh-cn": "官方仓库的稳定版本。有关详细信息，请参见：https://github.com/ylabonte/ioBroker.procon-ip"
            },
            "0.4.1": {
                "en": "Bugfix release: Fix write actions to the appropriate states of external relays. This will add auto-recognition on whether the external relays are activated or not and therefore decide on how to handle write actions to the corresponding relay state.",
                "de": "Bugfix Release: Schreibaktionen auf die entsprechenden Zustände externer Relais korrigieren. Dadurch wird die automatische Erkennung hinzugefügt, ob die externen Relais aktiviert sind oder nicht, und daher wird entschieden, wie Schreibaktionen in den entsprechenden Relaisstatus ausgeführt werden sollen.",
                "ru": "Исправление ошибок: исправление действий записи в соответствующих состояниях внешних реле. Это добавит автоматическое распознавание того, активированы ли внешние реле или нет, и, следовательно, решит, как обрабатывать действия записи в соответствующее состояние реле.",
                "pt": "Versão do bugfix: Corrija as ações de gravação nos estados apropriados dos relés externos. Isso adicionará o reconhecimento automático se os relés externos estão ativados ou não e, portanto, decidirá como lidar com as ações de gravação no estado correspondente do relé.",
                "nl": "Bugfix-release: schrijfacties corrigeren naar de juiste status van externe relais. Dit voegt automatische herkenning toe over het feit of de externe relais zijn geactiveerd of niet en beslist daarom hoe schrijfacties moeten worden afgehandeld in de overeenkomstige relaistoestand.",
                "fr": "Version de correction de bug: correction des actions d'écriture sur les états appropriés des relais externes. Cela ajoutera une reconnaissance automatique de l'activation ou non des relais externes et décidera donc comment gérer les actions d'écriture dans l'état de relais correspondant.",
                "it": "Rilascio bugfix: correggi le azioni di scrittura negli stati appropriati dei relè esterni. Ciò aggiungerà il riconoscimento automatico sull'attivazione o meno dei relè esterni e quindi la decisione su come gestire le azioni di scrittura nello stato di relè corrispondente.",
                "es": "Versión de corrección de errores: arregla las acciones de escritura en los estados apropiados de los relés externos. Esto agregará el reconocimiento automático de si los relés externos están activados o no y, por lo tanto, decidirá cómo manejar las acciones de escritura en el estado del relé correspondiente.",
                "pl": "Wydanie poprawki: Napraw działania zapisu w odpowiednich stanach przekaźników zewnętrznych. Spowoduje to dodanie automatycznego rozpoznawania, czy przekaźniki zewnętrzne są aktywowane, czy też nie, a zatem decyduje, w jaki sposób obsługiwać operacje zapisu do odpowiedniego stanu przekaźnika.",
                "zh-cn": "错误修正版本：将写操作修正为外部继电器的相应状态。这将增加对外部继电器是否已激活的自动识别，并因此决定如何处理对相应继电器状态的写操作。"
            },
            "0.4.0": {
                "en": "This release adds encryption to the ProCon.ip credentials, that are stored in ioBroker. This will break your adapter configuration, which simply means you will have to re-enter your controller-url, username, password and click save. It also should improve the http request/connection error handling and remove the unused admin tab.",
                "de": "Diese Version fügt den ProCon.ip-Anmeldeinformationen, die in ioBroker gespeichert sind, eine Verschlüsselung hinzu. Dadurch wird Ihre Adapterkonfiguration beschädigt, was einfach bedeutet, dass Sie Ihre Controller-URL, Ihren Benutzernamen und Ihr Kennwort erneut eingeben und auf Speichern klicken müssen. Es sollte auch die Behandlung von http-Anforderungs- / Verbindungsfehlern verbessern und die nicht verwendete Registerkarte \"Administrator\" entfernen.",
                "ru": "Этот выпуск добавляет шифрование к учетным данным ProCon.ip, которые хранятся в ioBroker. Это нарушит конфигурацию вашего адаптера, а это просто означает, что вам придется повторно ввести URL-адрес контроллера, имя пользователя, пароль и нажать «Сохранить». Это также должно улучшить обработку запросов / ошибок http и удалить неиспользуемую вкладку администратора.",
                "pt": "Esta versão adiciona criptografia às credenciais do ProCon.ip, armazenadas no ioBroker. Isso interromperá a configuração do adaptador, o que significa simplesmente que você precisará digitar novamente seu URL do controlador, nome de usuário, senha e clique em Salvar. Também deve melhorar a manipulação de erros de solicitação / conexão http e remover a guia de administração não utilizada.",
                "nl": "Deze release voegt encryptie toe aan de inloggegevens van ProCon.ip, die zijn opgeslagen in ioBroker. Hierdoor wordt uw adapterconfiguratie verbroken, wat simpelweg betekent dat u uw controller-url, gebruikersnaam en wachtwoord opnieuw moet invoeren en op Opslaan moet klikken. Het zou ook de afhandeling van http-verzoeken / verbindingsfouten moeten verbeteren en het ongebruikte admin-tabblad moeten verwijderen.",
                "fr": "Cette version ajoute un chiffrement aux informations d'identification ProCon.ip, qui sont stockées dans ioBroker. Cela cassera la configuration de votre adaptateur, ce qui signifie simplement que vous devrez ressaisir l'url de votre contrôleur, votre nom d'utilisateur, votre mot de passe et cliquer sur Enregistrer. Il devrait également améliorer la gestion des erreurs de demande / connexion http et supprimer l'onglet d'administration inutilisé.",
                "it": "Questa versione aggiunge la crittografia alle credenziali ProCon.ip, che sono archiviate in ioBroker. Ciò interromperà la configurazione dell'adattatore, il che significa semplicemente che dovrai inserire nuovamente l'URL del controller, il nome utente, la password e fare clic su Salva. Dovrebbe inoltre migliorare la gestione degli errori di richiesta / connessione http e rimuovere la scheda di amministrazione non utilizzata.",
                "es": "Esta versión agrega cifrado a las credenciales ProCon.ip, que se almacenan en ioBroker. Esto interrumpirá la configuración de su adaptador, lo que simplemente significa que tendrá que volver a ingresar su URL de controlador, nombre de usuario, contraseña y hacer clic en guardar. También debería mejorar el manejo de errores de solicitud / conexión http y eliminar la pestaña de administrador no utilizada.",
                "pl": "Ta wersja dodaje szyfrowanie do poświadczeń ProCon.ip, które są przechowywane w ioBroker. Spowoduje to uszkodzenie konfiguracji adaptera, co oznacza po prostu, że musisz ponownie wprowadzić adres URL kontrolera, nazwę użytkownika, hasło i kliknąć przycisk Zapisz. Powinno to również poprawić obsługę żądania HTTP / błędu połączenia i usunąć nieużywaną kartę administratora.",
                "zh-cn": "此版本将加密添加到ProCon.ip凭据中，该凭据存储在ioBroker中。这将破坏您的适配器配置，这仅意味着您将必须重新输入控制器URL，用户名，密码并单击“保存”。它还应改善http请求/连接错误处理并删除未使用的admin选项卡。"
            },
            "0.3.1":  {
                "en": "Functional update with security aspects. See README.md for details.",
                "de": "Funktionsaktualisierung mit Sicherheitsaspekten. Siehe README.md für Details.",
                "ru": "Функциональное обновление с аспектами безопасности. Смотрите README.md для подробностей.",
                "pt": "Atualização funcional com aspectos de segurança. Consulte README.md para obter detalhes.",
                "nl": "Functionele update met beveiligingsaspecten. Zie README.md voor details.",
                "fr": "Mise à jour fonctionnelle avec des aspects de sécurité. Voir README.md pour plus de détails.",
                "it": "Aggiornamento funzionale con aspetti di sicurezza. Vedi README.md per i dettagli.",
                "es": "Actualización funcional con aspectos de seguridad. Ver README.md para más detalles.",
                "pl": "Aktualizacja funkcjonalna z aspektami bezpieczeństwa. Szczegółowe informacje można znaleźć w pliku README.md.",
                "zh-cn": "具有安全方面的功能更新。有关详细信息，请参见README.md。"
            },
            "0.2.0": {
                "en": "Minor update",
                "de": "Kleinere Aktualisierung",
                "ru": "Незначительное обновление",
                "pt": "Atualização menor",
                "nl": "Kleine update",
                "fr": "Mise à jour mineure",
                "it": "Aggiornamento secondario",
                "es": "Actualización menor",
                "pl": "Drobna aktualizacja",
                "zh-cn": "小更新"
            },
            "0.1.1": {
                "en": "Security update",
                "de": "Sicherheitsupdate",
                "ru": "Обновление безопасности",
                "pt": "Atualização de segurança",
                "nl": "Beveiligingsupdate",
                "fr": "Mise à jour de sécurité",
                "it": "Aggiornamento di sicurezza",
                "es": "Actualización de seguridad",
                "pl": "Aktualizacja bezpieczeństwa",
                "zh-cn": "安全更新"
            },
            "0.1.0": {
                "en": "Functional update and minor fixes",
                "de": "Funktionsupdate und kleinere Korrekturen",
                "ru": "Функциональное обновление и мелкие исправления",
                "pt": "Atualização funcional e pequenas correções",
                "nl": "Functionele update en kleine aanpassingen",
                "fr": "Mise à jour fonctionnelle et correctifs mineurs",
                "it": "Aggiornamento funzionale e correzioni minori",
                "es": "Actualización funcional y correcciones menores",
                "pl": "Aktualizacja funkcjonalna i drobne poprawki",
                "zh-cn": "功能更新和次要修复"
            },
            "0.0.4": {
                "en": "Security update",
                "de": "Sicherheitsupdate",
                "ru": "Обновление безопасности",
                "pt": "Atualização de segurança",
                "nl": "Beveiligingsupdate",
                "fr": "Mise à jour de sécurité",
                "it": "Aggiornamento di sicurezza",
                "es": "Actualización de seguridad",
                "pl": "Aktualizacja bezpieczeństwa",
                "zh-cn": "安全更新"
            },
            "0.0.3": {
                "en": "Bugfix release",
                "de": "Bugfix Release",
                "ru": "Релиз исправления",
                "pt": "Bugfix release",
                "nl": "Bugfix-release",
                "fr": "Version du correctif",
                "it": "Rilascio bugfix",
                "es": "Lanzamiento de corrección de errores",
                "pl": "Wersja Bugfix",
                "zh-cn": "错误修正版本"
            },
            "0.0.2": {
                "en": "Bugfix release",
                "de": "Bugfix Release",
                "ru": "Релиз исправления",
                "pt": "Bugfix release",
                "nl": "Bugfix-release",
                "fr": "Version du correctif",
                "it": "Rilascio bugfix",
                "es": "Lanzamiento de corrección de errores",
                "pl": "Wersja Bugfix",
                "zh-cn": "错误修正版本"
            },
            "0.0.1": {
                "en": "initial release",
                "de": "Erstveröffentlichung",
                "ru": "Начальная версия",
                "pt": "lançamento inicial",
                "nl": "Eerste uitgave",
                "fr": "Première version",
                "it": "Versione iniziale",
                "es": "Versión inicial",
                "pl": "Pierwsze wydanie",
                "zh-cn": "首次出版"
            }
        },
        "title": "ProCon.IP Pool Control",
        "titleLang": {
            "en": "ProCon.IP Pool Control",
            "de": "ProCon.IP Poolsteuerung",
            "ru": "ProCon.IP управления бассейном",
            "pt": "ProCon.IP controle de piscina",
            "nl": "ProCon.IP zwembadregeling",
            "fr": "ProCon.IP le contrôle de la piscine",
            "it": "ProCon.IP controllo piscina",
            "es": "ProCon.IP control de la piscina",
            "pl": "ProCon.IP sterowanie basenem",
            "zh-cn": "ProCon.IP 池控制"
        },
        "desc": {
            "en": "ioBroker adapter for basic support of the ProCon.IP swimming pool control unit. It is intended for integration with your ioBroker home automation, eg. to build logic that involves other devices or simply to be paired with your favorit voice assistant(s).",
            "de": "ioBroker-Adapter zur grundlegenden Unterstützung der ProCon.IP-Schwimmbadsteuereinheit. Es ist für die Integration in Ihre ioBroker-Hausautomation vorgesehen, z. um eine Logik zu erstellen, an der andere Geräte beteiligt sind, oder um einfach mit Ihren bevorzugten Sprachassistenten gekoppelt zu werden.",
            "ru": "Адаптер ioBroker для базовой поддержки блока управления бассейном ProCon.IP. Он предназначен для интеграции с домашней системой автоматизации ioBroker, например. создать логику, которая включает в себя другие устройства или просто быть в паре с вашим голосовым помощником.",
            "pt": "Adaptador ioBroker para suporte básico da unidade de controle de piscinas ProCon.IP. Ele se destina à integração com sua automação residencial ioBroker, por exemplo. para criar lógica que envolva outros dispositivos ou simplesmente para emparelhar-se com seus assistentes de voz favoritos.",
            "nl": "ioBroker-adapter voor basisondersteuning van de ProCon.IP zwembadbesturing. Het is bedoeld voor integratie met uw ioBroker-domotica, bijv. om logica op te bouwen die andere apparaten omvat of gewoon om te worden gekoppeld aan uw favoriete stemassistent (en).",
            "fr": "Adaptateur ioBroker pour le support de base de l'unité de contrôle de piscine ProCon.IP. Il est destiné à être intégré à votre domotique ioBroker, par exemple. pour construire une logique qui implique d'autres appareils ou simplement pour être jumelé avec vos assistants vocaux préférés.",
            "it": "adattatore ioBroker per il supporto di base dell'unità di controllo della piscina ProCon.IP. È destinato all'integrazione con l'automazione domestica ioBroker, ad es. per costruire una logica che coinvolga altri dispositivi o semplicemente per essere accoppiato con i tuoi assistenti vocali preferiti.",
            "es": "Adaptador ioBroker para soporte básico de la unidad de control de piscina ProCon.IP. Está destinado a la integración con su domótica ioBroker, por ejemplo. para construir una lógica que involucre otros dispositivos o simplemente para que se vincule con su (s) asistente (s) de voz favorito (s).",
            "pl": "Adapter ioBroker do podstawowej obsługi jednostki sterującej basenu ProCon.IP. Jest przeznaczony do integracji z automatyką domową ioBroker, np. zbudować logikę, która obejmuje inne urządzenia lub po prostu sparować ze swoimi ulubionymi asystentami głosowymi.",
            "zh-cn": "ioBroker适配器，用于ProCon.IP游泳池控制单元的基本支持。它旨在与您的ioBroker家庭自动化集成，例如。建立涉及其他设备的逻辑，或者仅与您喜欢的语音助手配对。"
        },
        "authors": [
            "Yannic Labonte <yannic.labonte@gmail.com>"
        ],
        "keywords": [
            "ioBroker",
            "ProCon.IP",
            "pool control",
            "pool-digital",
            "pool controller",
            "home automation",
            "Smart Home"
        ],
        "license": "MIT",
        "platform": "Javascript/Node.js",
        "main": "build/main.js",
        "icon": "iobroker-procon-ip.png",
        "enabled": true,
        "extIcon": "https://raw.githubusercontent.com/ylabonte/ioBroker.procon-ip/master/admin/iobroker-procon-ip.png",
        "readme": "https://github.com/ylabonte/ioBroker.procon-ip/blob/master/README.md",
        "loglevel": "info",
        "mode": "daemon",
        "type": "iot-systems",
        "connectionType": "local",
        "dataSource": "poll",
        "compact": true,
        "materialize": true,
        "materializeTab": true,
        "adminTab": false,
        "supportCustoms": false,
        "dependencies": [
            {
                "js-controller": ">=2.2.0"
            }
        ]
    },
    "encryptedNative": [
        "controllerUrl",
        "username",
        "password"
    ],
    "protectedNative": [
        "controllerUrl",
        "username",
        "password"
    ],
    "native": {
        "controllerUrl": "",
        "basicAuth": true,
        "username": "admin",
        "password": "admin",
        "updateInterval": 3000,
        "requestTimeout": 10000,
        "errorTolerance": 10
    },
    "objects": [],
    "instanceObjects": [
        {
            "_id": "info",
            "type": "channel",
            "common": {
                "name": "Information"
            },
            "native": {}
        },
        {
            "_id": "info.connection",
            "type": "state",
            "common": {
                "role": "indicator.connected",
                "name": "Connection to the ProCon.IP",
                "type": "boolean",
                "read": true,
                "write": false,
                "def": false
            },
            "native": {}
        }
    ]
}
