{
    "common": {
        "name": "procon-ip",
        "version": "1.6.0",
        "news": {
            "1.6.0": {
                "en": "Code refactorings raising requirements (node >=18, js-controller>=5.0.19) and dependency updates.",
                "de": "Code-Refactorings und damit verbundene neue Mindestanforderungen (node >=18, js-controller>=5.0.19) sowie Updates von Abhängigkeiten.",
                "ru": "Кодовые рефакторинговые требования (node >=18, js-controller>=5.0.19) и обновления зависимостей.",
                "pt": "Refactorings de código levantando requisitos (node >=18, js-controller>=5.0.19) e atualizações de dependência.",
                "nl": "Code refactorings verhogende vereisten (node >= 18, js-controller>=5.01.19) en afhankelijkheidsupdates.",
                "fr": "Refacturations de code augmentant les exigences (noeud >=18, js-controller>=5.0.19) et mises à jour de dépendance.",
                "it": "Refactorings codice requisiti di sollevamento (nodo >=18, js-controller>=5.0.19) e aggiornamenti di dipendenza.",
                "es": "Refactorings Code raising requirements (node √18, js-controller confianza=5.0.19) y actualizaciones de dependencia.",
                "pl": "Wymagania dotyczące refakturowania kodu (węzeł > = 18, kontroler js- controller > = 5.0.19) oraz aktualizacje zależności.",
                "uk": "Вимоги до рефакторингу коду (node>=18, js-controller>=5.0.19) та оновлення залежностей.",
                "zh-cn": "代码重构提高要求(节点QQ18,js-controlerQQ5.0.19)和依赖性更新."
            },
            "1.5.5": {
                "en": "Dependency updates.",
                "de": "Abhängigkeitsaktualisierungen.",
                "ru": "Обновление зависимостей.",
                "pt": "Atualizações de dependência.",
                "nl": "Afhankelijkheid updates.",
                "fr": "Mises à jour sur la dépendance.",
                "it": "Aggiornamenti di dipendenza.",
                "es": "Actualizaciones de dependencia.",
                "pl": "Aktualizacje zależności.",
                "uk": "Залежність оновлення.",
                "zh-cn": "依赖性更新."
            },
            "1.5.4": {
                "en": "Dependency update and minor optimization in implementation.",
                "de": "Abhängigkeitsaktualisierung und kleinere Optimierung in der Implementierung.",
                "ru": "Обновление зависимости и незначительная оптимизация в реализации.",
                "pt": "Atualização de dependência e menor otimização na implementação.",
                "nl": "Dependency update en kleine optimalisatie in implementatie.",
                "fr": "Mise à jour de la dépendance et optimisation mineure dans la mise en œuvre.",
                "it": "Aggiornamento della dipendenza e ottimizzazione minore in implementazione.",
                "es": "Actualización de la dependencia y menor optimización en la aplicación.",
                "pl": "Aktualizacja zależności i mała optymalizacja w realizacji.",
                "uk": "Оновлення та оптимізація залежностей в реалізації.",
                "zh-cn": "实施中的依赖性更新和小优化."
            },
            "1.5.3": {
                "en": "Dependency updates",
                "de": "Aktualisierung von eingesetzten Code-Bibliotheken",
                "ru": "Обновления зависимостей",
                "pt": "Atualizações de dependência",
                "nl": "Afhankelijkheidsupdates",
                "fr": "Mises à jour sur la dépendance",
                "it": "Aggiornamenti di dipendenza",
                "es": "Actualizaciones de dependencia",
                "pl": "Aktualizacje zależności",
                "uk": "Оновлення залежності",
                "zh-cn": "依赖性更新"
            },
            "1.5.2": {
                "en": "Minor UI changes in adapter config and dependency updates.",
                "de": "Kleine Änderungen an der Konfigurationsoberfläche des Adapters und Abhängigkeitsaktualisierungen.",
                "ru": "Незначительные изменения пользовательского интерфейса в конфигурации адаптера и обновления зависимостей.",
                "pt": "Pequenas mudanças de interface de usuário nas atualizações de configuração e dependência do adaptador.",
                "nl": "Kleine wijzigingen in adapterconfiguratie en afhankelijkheidsupdates.",
                "fr": "Changements mineurs d'interface utilisateur dans la configuration de l'adaptateur et les mises à jour de dépendance.",
                "it": "Minori modifiche dell'interfaccia utente negli aggiornamenti di configurazione e dipendenza dell'adattatore.",
                "es": "Menor UI cambia en configuración de adaptador y actualizaciones de dependencia.",
                "pl": "Mniejsze zmiany interfejsu użytkownika w aktualizacjach konfiguracji adaptera i zależności.",
                "uk": "Мінор UI зміни в налаштуваннях адаптера та оновлення залежності.",
                "zh-cn": "适配器配置和依赖性更新中小的UI变化."
            },
            "1.5.1": {
                "en": "Code and translation files cleanup.",
                "de": "Bereinigung von Code- und Übersetzungsdateien.",
                "ru": "Очистка кода и файлов перевода.",
                "pt": "Limpeza de arquivos de código e tradução.",
                "nl": "Opschonen van code- en vertaalbestanden.",
                "fr": "Nettoyage des fichiers de code et de traduction.",
                "it": "Pulizia del codice e dei file di traduzione.",
                "es": "Limpieza de archivos de código y traducción.",
                "pl": "Czyszczenie kodu i plików tłumaczeń.",
                "uk": "Очищення файлів коду та перекладу.",
                "zh-cn": "代码和翻译文件清理。"
            },
            "1.5.0": {
                "en": "Code base modernization, removing support for obsolete credential encryption.",
                "de": "Modernisierung der Codebasis, Entfernung der Unterstützung für veraltete Anmeldeinformationsverschlüsselung.",
                "ru": "Модернизация базы кода, удаление поддержки устаревшего шифрования учетных данных.",
                "pt": "Modernização da base de código, removendo o suporte para criptografia de credenciais obsoletas.",
                "nl": "Modernisering van de codebasis, waarbij de ondersteuning voor verouderde legitimatieversleuteling wordt verwijderd.",
                "fr": "Modernisation de la base de code, suppression de la prise en charge du cryptage des informations d'identification obsolètes.",
                "it": "Modernizzazione della base di codice, rimozione del supporto per la crittografia delle credenziali obsoleta.",
                "es": "Modernización de la base de código, eliminando la compatibilidad con el cifrado de credenciales obsoletas.",
                "pl": "Modernizacja bazy kodu, usunięcie obsługi przestarzałego szyfrowania poświadczeń.",
                "uk": "Модернізація бази коду, усунення підтримки застарілого шифрування облікових даних.",
                "zh-cn": "代码库现代化，删除对过时凭证加密的支持。"
            },
            "1.4.0": {
                "en": "Add generic relay timers and update dependencies",
                "de": "Einführung allgemeiner Relais-Timer und Aktualisierung von Abhängigkeiten",
                "ru": "Добавьте таймеры генерических релей и обновляйте зависимости",
                "pt": "Adicionar temporizadores de relé genéricos e dependências de atualização",
                "nl": "Add generische relais timers en update afhankelijkheid",
                "fr": "Ajouter les temps de relais génériques et mettre à jour les dépendances",
                "it": "Aggiungi timer generici di relè e aggiorna le dipendenze",
                "es": "Agregar cronogramas de relé genéricos y dependencias de actualización",
                "pl": "Adddition timers and update Dependencyjność",
                "uk": "Додавання генних таймерів реле та оновлення залежностей",
                "zh-cn": "增加通用的延迟时间和最新频率"
            }
        },
        "titleLang": {
            "en": "ProCon.IP Pool Control",
            "de": "ProCon.IP Poolsteuerung",
            "ru": "ProCon.IP управления бассейном",
            "pt": "ProCon.IP controle de piscina",
            "nl": "ProCon.IP zwembadregeling",
            "fr": "ProCon.IP le contrôle de la piscine",
            "it": "ProCon.IP controllo piscina",
            "es": "ProCon.IP control de la piscina",
            "pl": "ProCon.IP sterowanie basenem",
            "zh-cn": "ProCon.IP 池控制",
            "uk": "Контроль пулу ProCon.IP"
        },
        "desc": {
            "en": "ioBroker adapter for basic support of the ProCon.IP swimming pool control unit. It is intended for integration with your ioBroker home automation, eg. to build logic that involves other devices or simply to be paired with your favorit voice assistant(s).",
            "de": "ioBroker-Adapter zur grundlegenden Unterstützung der ProCon.IP-Schwimmbadsteuereinheit. Es ist für die Integration in Ihre ioBroker-Hausautomation vorgesehen, z. um eine Logik zu erstellen, an der andere Geräte beteiligt sind, oder um einfach mit Ihren bevorzugten Sprachassistenten gekoppelt zu werden.",
            "ru": "Адаптер ioBroker для базовой поддержки блока управления бассейном ProCon.IP. Он предназначен для интеграции с домашней системой автоматизации ioBroker, например. создать логику, которая включает в себя другие устройства или просто быть в паре с вашим голосовым помощником.",
            "pt": "Adaptador ioBroker para suporte básico da unidade de controle de piscinas ProCon.IP. Ele se destina à integração com sua automação residencial ioBroker, por exemplo. para criar lógica que envolva outros dispositivos ou simplesmente para emparelhar-se com seus assistentes de voz favoritos.",
            "nl": "ioBroker-adapter voor basisondersteuning van de ProCon.IP zwembadbesturing. Het is bedoeld voor integratie met uw ioBroker-domotica, bijv. om logica op te bouwen die andere apparaten omvat of gewoon om te worden gekoppeld aan uw favoriete stemassistent (en).",
            "fr": "Adaptateur ioBroker pour le support de base de l'unité de contrôle de piscine ProCon.IP. Il est destiné à être intégré à votre domotique ioBroker, par exemple. pour construire une logique qui implique d'autres appareils ou simplement pour être jumelé avec vos assistants vocaux préférés.",
            "it": "adattatore ioBroker per il supporto di base dell'unità di controllo della piscina ProCon.IP. È destinato all'integrazione con l'automazione domestica ioBroker, ad es. per costruire una logica che coinvolga altri dispositivi o semplicemente per essere accoppiato con i tuoi assistenti vocali preferiti.",
            "es": "Adaptador ioBroker para soporte básico de la unidad de control de piscina ProCon.IP. Está destinado a la integración con su domótica ioBroker, por ejemplo. para construir una lógica que involucre otros dispositivos o simplemente para que se vincule con su (s) asistente (s) de voz favorito (s).",
            "pl": "Adapter ioBroker do podstawowej obsługi jednostki sterującej basenu ProCon.IP. Jest przeznaczony do integracji z automatyką domową ioBroker, np. zbudować logikę, która obejmuje inne urządzenia lub po prostu sparować ze swoimi ulubionymi asystentami głosowymi.",
            "zh-cn": "ioBroker适配器，用于ProCon.IP游泳池控制单元的基本支持。它旨在与您的ioBroker家庭自动化集成，例如。建立涉及其他设备的逻辑，或者仅与您喜欢的语音助手配对。",
            "uk": "Адаптер ioBroker для базової підтримки блоку керування басейном ProCon.IP. Він призначений для інтеграції з системою домашньої автоматизації ioBroker, наприклад. створювати логіку, яка залучає інші пристрої, або просто бути в парі з вашим улюбленим голосовим помічником(ами)."
        },
        "authors": [
            "Yannic Labonte <yannic.labonte@gmail.com>"
        ],
        "keywords": [
            "ProCon.IP",
            "procon",
            "pool-digital",
            "swimming",
            "pool"
        ],
        "platform": "Javascript/Node.js",
        "icon": "procon-ip.png",
        "enabled": true,
        "extIcon": "https://raw.githubusercontent.com/ylabonte/ioBroker.procon-ip/master/admin/procon-ip.png",
        "readme": "https://github.com/ylabonte/ioBroker.procon-ip/blob/master/README.md",
        "loglevel": "info",
        "mode": "daemon",
        "type": "iot-systems",
        "tier": 2,
        "connectionType": "local",
        "dataSource": "poll",
        "compact": true,
        "adminUI": {
            "config": "json"
        },
        "supportCustoms": false,
        "dependencies": [
            {
                "js-controller": ">=5.0.19"
            }
        ],
        "globalDependencies": [
            {
                "admin": ">=5.1.13"
            }
        ],
        "licenseInformation": {
            "license": "MIT",
            "link": "https://github.com/ylabonte/ioBroker.procon-ip/blob/master/LICENSE",
            "type": "free"
        }
    },
    "encryptedNative": [
        "controllerUrl",
        "username",
        "password"
    ],
    "protectedNative": [
        "controllerUrl",
        "username",
        "password"
    ],
    "native": {
        "controllerUrl": "",
        "basicAuth": true,
        "username": "",
        "password": "",
        "updateInterval": 3000,
        "requestTimeout": 10000,
        "errorTolerance": 10
    },
    "objects": [],
    "instanceObjects": [
        {
            "_id": "info",
            "type": "channel",
            "common": {
                "name": "Information"
            },
            "native": {}
        },
        {
            "_id": "info.connection",
            "type": "state",
            "common": {
                "role": "indicator.connected",
                "name": "Connection to the ProCon.IP",
                "type": "boolean",
                "read": true,
                "write": false,
                "def": false
            },
            "native": {}
        }
    ]
}
